Ran Plan for 2 projects:

1. dir: `.` workspace: `stage`
1. dir: `.` workspace: `prod`

### 1. dir: `.` workspace: `stage`
<details><summary>Show Output</summary>

```diff
data.yandex_compute_image.ubuntu: Reading...
data.yandex_compute_image.ubuntu: Read complete after 2s [id=fd8h059qvtg37ks9ke9o]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.inventory will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "inventory" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            [all]
            ${connection_strings_master}
            ${connection_strings_node}
            
            [kube_control_plane]
            ${list_master}
            
            [kube_node]
            ${list_node}
            
            [etcd]
            ${list_master}
            
            [k8s_cluster:children]
            kube_node
            kube_control_plane
        EOT
+       vars     = {
+           "connection_strings_master" = (known after apply)
+           "connection_strings_node"   = (known after apply)
+           "list_master"               = "diploma-control-stage-0"
+           "list_node"                 = "diploma-worker-stage-0"
        }
    }

  # data.template_file.kubectl will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "kubectl" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            ---
            - name: Get kuber credentials
              hosts: diploma-control-${workspace}-0
              become: yes
              gather_facts: yes
              tasks:
                - name: Save host to var
                  set_fact:
                    kube_control_node: "{{ ansible_host }}"
                - name: Print fact
                  debug:
                    var: kube_control_node
            
                - name: Duplicate folder kube
                  copy:
                    src: /etc/kubernetes/admin.conf
                    dest: /etc/kubernetes/admin_export.conf
                    remote_src: yes
                    mode: 0755
            
                - name: Set Kube IP in config
                  replace:
                    path: /etc/kubernetes/admin_export.conf
                    regexp: "server: https://[0-9.]*:"
                    replace: "server: https://{{ kube_control_node }}:"
                - name: Fetch kube config
                  synchronize:
                    src: /etc/kubernetes/admin_export.conf
                    dest: ../kubeconfig/config-${workspace}
                    delete: yes
                    recursive: yes
                    owner: no
                    group: no
                    mode: pull
        EOT
+       vars     = {
+           "workspace" = "stage"
        }
    }

  # data.template_file.supplementary_addresses_in_ssl_keys will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "supplementary_addresses_in_ssl_keys" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            ---
            - name: Allow access by public IP
              hosts: localhost
              become: no
              gather_facts: no
              tasks:
                  - name: Configure option in k8s-cluster.yml
                    replace:
                      path: ../kubespray/inventory/diplomacluster/group_vars/k8s_cluster/k8s-cluster.yml
                      regexp: '^.*supplementary_addresses_in_ssl_keys:.*'
                      replace: "supplementary_addresses_in_ssl_keys: [127.0.0.1, {{ hostvars[\"diploma-control-${workspace}-0\"][\"ansible_host\"] }}]"
        EOT
+       vars     = {
+           "workspace" = "stage"
        }
    }

  # null_resource.app will be created
+ resource "null_resource" "app" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.folder will be created
+ resource "null_resource" "folder" {
+       id = (known after apply)
    }

  # null_resource.git_clone will be created
+ resource "null_resource" "git_clone" {
+       id = (known after apply)
    }

  # null_resource.grafana_public will be created
+ resource "null_resource" "grafana_public" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.inventories will be created
+ resource "null_resource" "inventories" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.kube_prometheus will be created
+ resource "null_resource" "kube_prometheus" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.kubectl will be created
+ resource "null_resource" "kubectl" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.kubectl_playbook will be created
+ resource "null_resource" "kubectl_playbook" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.kubespray will be created
+ resource "null_resource" "kubespray" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.public_access will be created
+ resource "null_resource" "public_access" {
+       id = (known after apply)
    }

  # null_resource.requirements will be created
+ resource "null_resource" "requirements" {
+       id = (known after apply)
    }

  # null_resource.supplementary_addresses_in_ssl_keys_playbook will be created
+ resource "null_resource" "supplementary_addresses_in_ssl_keys_playbook" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.wait will be created
+ resource "null_resource" "wait" {
+       id = (known after apply)
    }

  # yandex_compute_instance.control[0] will be created
+ resource "yandex_compute_instance" "control" {
+       created_at                = (known after apply)
+       folder_id                 = (known after apply)
+       fqdn                      = (known after apply)
+       hostname                  = "diploma-control-stage-0.local"
+       id                        = (known after apply)
+       metadata                  = {
+           "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCqy1AP5PTjDI9Wbgsu2NrODcokBvQkqJ2Pf3ZUWTGHh1t5Ec0PwJScXgXU2x1r8wxtu6r3964vusfVYz4maWDASEz/qBhOGjVUDWhHjxWX23Z68liybzxEBcKVtOlJPfBGCsSoneScYCn1K+1/ADLfYVEG9+5zjefInoBqIcjoBKd58tzgMqNi2LDln4PPUKSo/BUJ++BtCyJs3vTkr0VyLNmFo5XZwHSAvGmmWZt3pqk42lEwYOQiRUNHB6PKX0Kxm/fOmjd6cr/kba/OhDJOeUWAL9CeriP/A7nSJ253detyqpxk7oaRFktYZgBX4WqW41ZTMitEUpRppOOoGNWPjfE1KpS1RhKy2MtIMuauHwVLNZbgMrNP6HGnVHjFEx66C2VYUfhhy8wBobYj6qNoAjwqVajxOzbVQN0dXCSb0LXbCLMeJigA+fOhzKp5gEoTXjDf5/5uMOKXQYQ6h1T+R9Vg+ZUlgjj4jUnvP9gcJQ/TqquAmJ//wLjyRg0gBG8= sergey@sergey-ubuntu-home
            EOT
        }
+       name                      = "diploma-control-stage-0"
+       network_acceleration_type = "standard"
+       platform_id               = "standard-v1"
+       service_account_id        = (known after apply)
+       status                    = (known after apply)
+       zone                      = (known after apply)

+       boot_disk {
+           auto_delete = true
+           device_name = (known after apply)
+           disk_id     = (known after apply)
+           mode        = (known after apply)

+           initialize_params {
+               block_size  = (known after apply)
+               description = (known after apply)
+               image_id    = "fd8h059qvtg37ks9ke9o"
+               name        = (known after apply)
+               size        = 50
+               snapshot_id = (known after apply)
+               type        = "network-hdd"
            }
        }

+       network_interface {
+           index              = (known after apply)
+           ip_address         = (known after apply)
+           ipv4               = true
+           ipv6               = false
+           ipv6_address       = (known after apply)
+           mac_address        = (known after apply)
+           nat                = true
+           nat_ip_address     = (known after apply)
+           nat_ip_version     = (known after apply)
+           security_group_ids = (known after apply)
+           subnet_id          = (known after apply)
        }

+       placement_policy {
+           host_affinity_rules = (known after apply)
+           placement_group_id  = (known after apply)
        }

+       resources {
+           core_fraction = 100
+           cores         = 2
+           memory        = 2
        }

+       scheduling_policy {
+           preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.worker[0] will be created
+ resource "yandex_compute_instance" "worker" {
+       created_at                = (known after apply)
+       folder_id                 = (known after apply)
+       fqdn                      = (known after apply)
+       hostname                  = "diploma-worker-stage-0.local"
+       id                        = (known after apply)
+       metadata                  = {
+           "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCqy1AP5PTjDI9Wbgsu2NrODcokBvQkqJ2Pf3ZUWTGHh1t5Ec0PwJScXgXU2x1r8wxtu6r3964vusfVYz4maWDASEz/qBhOGjVUDWhHjxWX23Z68liybzxEBcKVtOlJPfBGCsSoneScYCn1K+1/ADLfYVEG9+5zjefInoBqIcjoBKd58tzgMqNi2LDln4PPUKSo/BUJ++BtCyJs3vTkr0VyLNmFo5XZwHSAvGmmWZt3pqk42lEwYOQiRUNHB6PKX0Kxm/fOmjd6cr/kba/OhDJOeUWAL9CeriP/A7nSJ253detyqpxk7oaRFktYZgBX4WqW41ZTMitEUpRppOOoGNWPjfE1KpS1RhKy2MtIMuauHwVLNZbgMrNP6HGnVHjFEx66C2VYUfhhy8wBobYj6qNoAjwqVajxOzbVQN0dXCSb0LXbCLMeJigA+fOhzKp5gEoTXjDf5/5uMOKXQYQ6h1T+R9Vg+ZUlgjj4jUnvP9gcJQ/TqquAmJ//wLjyRg0gBG8= sergey@sergey-ubuntu-home
            EOT
        }
+       name                      = "diploma-worker-stage-0"
+       network_acceleration_type = "standard"
+       platform_id               = "standard-v1"
+       service_account_id        = (known after apply)
+       status                    = (known after apply)
+       zone                      = (known after apply)

+       boot_disk {
+           auto_delete = true
+           device_name = (known after apply)
+           disk_id     = (known after apply)
+           mode        = (known after apply)

+           initialize_params {
+               block_size  = (known after apply)
+               description = (known after apply)
+               image_id    = "fd8h059qvtg37ks9ke9o"
+               name        = (known after apply)
+               size        = 100
+               snapshot_id = (known after apply)
+               type        = "network-hdd"
            }
        }

+       network_interface {
+           index              = (known after apply)
+           ip_address         = (known after apply)
+           ipv4               = true
+           ipv6               = false
+           ipv6_address       = (known after apply)
+           mac_address        = (known after apply)
+           nat                = true
+           nat_ip_address     = (known after apply)
+           nat_ip_version     = (known after apply)
+           security_group_ids = (known after apply)
+           subnet_id          = (known after apply)
        }

+       placement_policy {
+           host_affinity_rules = (known after apply)
+           placement_group_id  = (known after apply)
        }

+       resources {
+           core_fraction = 100
+           cores         = 2
+           memory        = 4
        }

+       scheduling_policy {
+           preemptible = (known after apply)
        }
    }

  # yandex_iam_service_account.diploma will be created
+ resource "yandex_iam_service_account" "diploma" {
+       created_at = (known after apply)
+       folder_id  = "b1g01oeuesd31te4bm64"
+       id         = (known after apply)
+       name       = "diploma-stage"
    }

  # yandex_iam_service_account_static_access_key.diploma will be created
+ resource "yandex_iam_service_account_static_access_key" "diploma" {
+       access_key           = (known after apply)
+       created_at           = (known after apply)
+       description          = "static access key for object storage"
+       encrypted_secret_key = (known after apply)
+       id                   = (known after apply)
+       key_fingerprint      = (known after apply)
+       secret_key           = (sensitive value)
+       service_account_id   = (known after apply)
    }

  # yandex_resourcemanager_folder_iam_member.editor will be created
+ resource "yandex_resourcemanager_folder_iam_member" "editor" {
+       folder_id = "b1g01oeuesd31te4bm64"
+       id        = (known after apply)
+       member    = (known after apply)
+       role      = "editor"
    }

  # yandex_resourcemanager_folder_iam_member.viewer will be created
+ resource "yandex_resourcemanager_folder_iam_member" "viewer" {
+       folder_id = "b1g01oeuesd31te4bm64"
+       id        = (known after apply)
+       member    = (known after apply)
+       role      = "viewer"
    }

  # yandex_vpc_network.dimploma will be created
+ resource "yandex_vpc_network" "dimploma" {
+       created_at                = (known after apply)
+       default_security_group_id = (known after apply)
+       folder_id                 = (known after apply)
+       id                        = (known after apply)
+       labels                    = (known after apply)
+       name                      = "dimploma-stage"
+       subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.private will be created
+ resource "yandex_vpc_subnet" "private" {
+       created_at     = (known after apply)
+       folder_id      = (known after apply)
+       id             = (known after apply)
+       labels         = (known after apply)
+       name           = "private-stage"
+       network_id     = (known after apply)
+       v4_cidr_blocks = [
+           "10.0.2.0/24",
        ]
+       v6_cidr_blocks = (known after apply)
+       zone           = (known after apply)
    }

  # yandex_vpc_subnet.public will be created
+ resource "yandex_vpc_subnet" "public" {
+       created_at     = (known after apply)
+       folder_id      = (known after apply)
+       id             = (known after apply)
+       labels         = (known after apply)
+       name           = "public-stage"
+       network_id     = (known after apply)
+       v4_cidr_blocks = [
+           "10.0.0.0/24",
        ]
+       v6_cidr_blocks = (known after apply)
+       zone           = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ control_nodes = [
+       (known after apply),
    ]
+ worker_nodes  = [
+       (known after apply),
    ]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "yandex_token" but a
│ value was found in file ".auto.tfvars". If you meant to use this value, add
│ a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w stage`
* :put_litter_in_its_place: To **delete** this plan click [here](http://178.154.204.124:30141/lock?id=run0ut%252Fdiploma-terraform%252F.%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w stage`
</details>
Plan: 22 to add, 0 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `prod`
<details><summary>Show Output</summary>

```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "yandex_token" but a
│ value was found in file ".auto.tfvars". If you meant to use this value, add
│ a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w prod`
* :put_litter_in_its_place: To **delete** this plan click [here](http://178.154.204.124:30141/lock?id=run0ut%252Fdiploma-terraform%252F.%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w prod`
</details>
No changes. Your infrastructure matches the configuration.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
